In [32]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [44]:
%sql sqlite:///sample1.db

u'Connected: None@sample1.db'

In [46]:
%%sql
create table emp (
        empno int not null,
        empname char(10) unique,
        title char(10) default '사원',
        manager int,
        salary int check(salary < 6000000),
        dno int,
        primary key(empno),
        foreign key(manager) references emp(empno),
        foreign key(dno) references dept(deptno) on update cascade
        );

insert into emp values(4377, '이성래', '사장', NULL, 5000000, 2);
insert into emp values(3426, '박영권', '과장', 4377, 3000000, 1);
insert into emp values(3011, '이수민', '부장', 4377, 4000000, 3);
insert into emp values(3427, '최종철', '사원', 3011, 1500000, 3);
insert into emp values(1003, '조민희', '과장', 4377, 3000000, 2);
insert into emp values(2106, '김창섭', '대리', 1003, 2500000, 2);
insert into emp values(1365, '김상원', '사원', 3426, 1500000, 1);


create view emp_planning
        as
        select e.empname, e.title, e.salary
        from emp e, dept d
        where e.dno = d.deptno and d.deptname = '기획'

Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[]

In [47]:
%sql select * from dept;

Done.

[(1, u'\uc601\uc5c5', 8),
 (2, u'\uae30\ud68d', 10),
 (3, u'\uac1c\ubc1c', 9),
 (4, u'\ucd1d\ubd80', 7)]

In [48]:
%sql select * from emp;

Done.

[(4377, u'\uc774\uc131\ub798', u'\uc0ac\uc7a5', None, 5000000, 2),
 (3426, u'\ubc15\uc601\uad8c', u'\uacfc\uc7a5', 4377, 3000000, 1),
 (3011, u'\uc774\uc218\ubbfc', u'\ubd80\uc7a5', 4377, 4000000, 3),
 (3427, u'\ucd5c\uc885\ucca0', u'\uc0ac\uc6d0', 3011, 1500000, 3),
 (1003, u'\uc870\ubbfc\ud76c', u'\uacfc\uc7a5', 4377, 3000000, 2),
 (2106, u'\uae40\ucc3d\uc12d', u'\ub300\ub9ac', 1003, 2500000, 2),
 (1365, u'\uae40\uc0c1\uc6d0', u'\uc0ac\uc6d0', 3426, 1500000, 1)]

In [49]:
%sql sqlite:///sample2db.db

u'Connected: None@sample2db.db'

In [50]:
%%sql
create table student (
        sid smallint constraint const_student_pk PRIMARY KEY,
        sname char(20) NULL,
        major varchar(30) NULL,
        gradelevel char(2)
        constraint const_student_gr check ( gradelevel in ('GR', 'SO', 'GR', 'SN', 'JR', 'FR')),
        Age smallint NULL
        constraint const_student_age check ( age > 0 )
) ;


create table class (
        cname char(5),
        time varchar(7),
        room char(5),
        constraint const_class_pk primary key (cname)
        );

create table enrollment (
        studentnumber smallint,
        classname char(5),
        positionnumber smallint,
        constraint const_enroll_pk primary key (studentnumber, classname),
        constraint const_enroll_fk_snum foreign key (studentnumber) references student(sid),
        constraint const_enroll_fk_cname foreign key (classname) references class(cname)
);


insert into student values ( 100, 'JONES', 'HISTORY', 'GR', 21);
insert into student values ( 150, 'PARKS', 'ACCOUNTING', 'SO', 19);
insert into student values ( 200, 'BAKER', 'MATH', 'GR', 50);
insert into student values ( 250, 'GLASS', 'HISTORY', 'SN', 50);
insert into student values ( 300, 'BAKER', 'ACCOUNTING', 'SN', 41);
insert into student values ( 350, 'RUSSEL', 'MATH', 'JR', 20);
insert into student values ( 400, 'RYE', 'ACCOUNTING', 'FR', 18);
insert into student values ( 450, 'JONES', 'HISTORY', 'SN', 24);

insert into class values ( 'BA200', 'M-F9', 'SC110');
insert into class values ( 'BD445', 'MWF3', 'SC213');
insert into class values ( 'BF410', 'MWF8', 'SC213');
insert into class values ( 'CS150', 'MWF3', 'EA304');
insert into class values ( 'CS250', 'MWF12', 'EB210');

insert into enrollment values (100, 'BD445', 1);
insert into enrollment values (150, 'BA200', 1);
insert into enrollment values (200, 'BD445', 2);
insert into enrollment values (200, 'CS250', 1);
insert into enrollment values (300, 'CS150', 1);
insert into enrollment values (400, 'BA200', 2);
insert into enrollment values (400, 'BF410', 1);
insert into enrollment values (400, 'CS250', 2);
insert into enrollment values (450, 'BA200', 3);

Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [54]:
%%sql
select * from student;

Done.

[(100, u'JONES', u'HISTORY', u'GR', 21),
 (150, u'PARKS', u'ACCOUNTING', u'SO', 19),
 (200, u'BAKER', u'MATH', u'GR', 50),
 (250, u'GLASS', u'HISTORY', u'SN', 50),
 (300, u'BAKER', u'ACCOUNTING', u'SN', 41),
 (350, u'RUSSEL', u'MATH', u'JR', 20),
 (400, u'RYE', u'ACCOUNTING', u'FR', 18),
 (450, u'JONES', u'HISTORY', u'SN', 24)]

In [55]:
%sql select * from class;

Done.

[(u'BA200', u'M-F9', u'SC110'),
 (u'BD445', u'MWF3', u'SC213'),
 (u'BF410', u'MWF8', u'SC213'),
 (u'CS150', u'MWF3', u'EA304'),
 (u'CS250', u'MWF12', u'EB210')]

In [56]:
%%sql
select * from enrollment;

Done.

[(100, u'BD445', 1),
 (150, u'BA200', 1),
 (200, u'BD445', 2),
 (200, u'CS250', 1),
 (300, u'CS150', 1),
 (400, u'BA200', 2),
 (400, u'BF410', 1),
 (400, u'CS250', 2),
 (450, u'BA200', 3)]

In [57]:
%sql sqlite:///sample3db.db

u'Connected: None@sample3db.db'

In [60]:
%%sql
create table s (
        sno char(5) NOT NULL primary key,
        sname char(10) NULL,
        city char(10) NULL
        );

create table p (
        pno char(5) NOT NULL
        primary key,
        pname char(10) NULL,
        color char(10) NULL,
        WEIGHT SMALLINT NULL,
        city char(10) NULL
        );

create table sp (
        sno char(5) NOT NULL,
        pno char(5) NOT NULL,
        qty SMALLINT NULL,
        constraint PK_SP primary key (sno, pno),
        constraint FK_SP_S foreign key (sno) references S on update cascade,
        constraint FK_SP_P foreign key (pno) references P on delete cascade
        );

insert into s values ('s01', 'Smith', 'London');
insert into s values ('s02', 'jones', 'Paris');
insert into s values ('s03', 'blakes', 'Paris');
insert into s values ('s04', 'clark', 'London');
insert into s values ('s05', 'adams', 'Athenes');

insert into p values ('p01', 'Nut', 'red', 12, 'London');
insert into p values ('p02', 'Bolt', 'green', 17, 'Paris');
insert into p values ('p03', 'Screw', 'blue', 17, 'Rome');
insert into p values ('p04', 'Screw', 'red', 14, 'London');
insert into p values ('p05', 'cam', 'blue', 12, 'Paris');
insert into p values ('p06', 'cog', 'red', 19, 'London');

insert into sp values ('s01', 'p01', 300);
insert into sp values ('s01', 'p02', 200);
insert into sp values ('s01', 'p03', 400);
insert into sp values ('s01', 'p04', 500);
insert into sp values ('s01', 'p05', 100);
insert into sp values ('s01', 'p06', 200);
insert into sp values ('s02', 'p01', 300);
insert into sp values ('s02', 'p02', 400);
insert into sp values ('s03', 'p02', 200);
insert into sp values ('s04', 'p04', 300);
insert into sp values ('s05', 'p05', 400);

Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [61]:
%%sql
select * from s;

Done.

[(u's01', u'Smith', u'London'),
 (u's02', u'jones', u'Paris'),
 (u's03', u'blakes', u'Paris'),
 (u's04', u'clark', u'London'),
 (u's05', u'adams', u'Athenes')]

In [62]:
%%sql
select * from p;

Done.

[(u'p01', u'Nut', u'red', 12, u'London'),
 (u'p02', u'Bolt', u'green', 17, u'Paris'),
 (u'p03', u'Screw', u'blue', 17, u'Rome'),
 (u'p04', u'Screw', u'red', 14, u'London'),
 (u'p05', u'cam', u'blue', 12, u'Paris'),
 (u'p06', u'cog', u'red', 19, u'London')]

In [63]:
%%sql
select * from sp;

Done.

[(u's01', u'p01', 300),
 (u's01', u'p02', 200),
 (u's01', u'p03', 400),
 (u's01', u'p04', 500),
 (u's01', u'p05', 100),
 (u's01', u'p06', 200),
 (u's02', u'p01', 300),
 (u's02', u'p02', 400),
 (u's03', u'p02', 200),
 (u's04', u'p04', 300),
 (u's05', u'p05', 400)]